IDEA Open Model
ConcreteBlockData.AxisX Property
Compatible with IDEA StatiCa 20.1
 LCS - Axis X
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public Vector3D AxisX { get; set; }
Public Property AxisX As Vector3D
	Get
	Set
Property Value
Type: Vector3D
See Also
Reference
ConcreteBlockData Class
IdeaRS.OpenModel.Connection Namespace